//Задача 1
//Напиши програма каде ќе се испечатат сите броеви од 1-100.
//Резултатот да се отпечати.

#include <iostream>
using namespace std;
int main(){
    for(int i=0;i<100;i++){
        cout<<"Number is: "<<(i+1)<<endl;
    }
    return 0;
}
